# APPLICATIONS
##### 1.WEB SCRAPING
##### 2.WEB DEVELOPMENT
##### 3.Data ANALYSIS
##### 4.FEATURE ENGINEERING AND MANY MORE

In [1]:
import pandas as pd

In [2]:
XYZ_web = {'day': [1, 2, 3, 4, 5, 6],
           'visitors': [1000, 800, 1200, 1500, 1100, 900],
           'bounce_rate': [0.2, 0.3, 0.25, 0.15, 0.3, 0.4]}

In [5]:
df = pd.DataFrame(XYZ_web)
df.set_index('day', inplace=True)
df

     visitors  bounce_rate
day
1        1000         0.20
2         800         0.30
3        1200         0.25
4        1500         0.15
5        1100         0.30
6         900         0.40

In [6]:
print(df.head(2))

     visitors  bounce_rate
day
1        1000          0.2
2         800          0.3

In [7]:
print(df.tail(2))

     visitors  bounce_rate
day
5        1100          0.3
6         900          0.4

In [8]:
# Three dictionaries for merge practice
dict_a = {"id": 1, "name": "Alice", "skills": ["Python", "SQL"]}
dict_b = {"id": 1, "email": "alice@example.com", "location": "NY"}
dict_c = {"id": 1, "name": "Alice B.", "skills": ["Python", "Pandas"], "phone": "555-1234"}

In [9]:
df1 = pd.DataFrame([dict_a])
df2 = pd.DataFrame([dict_b])
df3 = pd.DataFrame([dict_c])

In [10]:
merge = pd.merge(df1, df2, on="id")

In [11]:
merge

   id   name         skills              email location
0   1  Alice  [Python, SQL]  alice@example.com       NY

In [12]:
final_df = pd.merge(merge, df3, on="id")
final_df

,id,name_x,skills_x,email,location,name_y,skills_y,phone
0,1,Alice,"[Python, SQL]",alice@example.com,NY,Alice B.,"[Python, Pandas]",555-1234